#include "backend.h"

Backend::Backend()
{
  //  m_data="{\"type\":\"Распределение слов по их длинам\",\"first\":\"Длина слова\",\"second\":\"Количество слов\",\"values\":[{\"2\":\"1\"},{\"3\":\"1\"},{\"4\":\"1\"},{\"5\":\"1\"},{\"6\":\"2\"},]}";
      m_data="{\"type\":\"Распределение слов по их длинам\",\"first\":\"Длина слова\",\"second\":\"Количество слов\",\"values\":[{\"len\":\"2\",\"count\":\"1\"},{\"len\":\"3\",\"count\":\"1\"},{\"len\":\"4\",\"count\":\"1\"},{\"len\":\"5\",\"count\":\"1\"},{\"len\":\"6\",\"count\":\"2\"}]}";

}

QString Backend::data() const
{
    return m_data;
}
